"""Найти площадь круга по известному радиусу"""
import math

r = int(input("Введите радиус круга: "))

S = math.pi * r**2

print("Площадь круга равна:", S)